src/Конфигурация/Documents/ПланДвиженияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ПланДвиженияДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланДвиженияДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяПлана</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расшифровка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Конфигурация/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Конфигурация/Documents/ПланДвиженияДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Объект.НачалоПериода = ПолучитьНачалоПериода(Объект.НачалоПериода,Объект.Периодичность); 
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Объект.КонецПериода = ПолучитьКонецПериода(Объект.КонецПериода,Объект.Периодичность);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНачалоПериода(Дата,Периодичность)
	Если Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели(Дата);
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьКонецПериода(Дата,Периодичность)
	Если Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат КонецКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат КонецМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат КонецНедели(Дата);
	Иначе
		Возврат КонецДня(Дата);
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	Объект.НачалоПериода = ПолучитьНачалоПериода(Объект.НачалоПериода,Объект.Периодичность); 
	Объект.КонецПериода  = ПолучитьКонецПериода(Объект.КонецПериода,Объект.Периодичность);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормСервер.НастройкаПриСозданииФормы(ЭтаФорма,Объект,"План");
КонецПроцедуры

// УПРАВЛЕНИЕ ФОРМОЙ //

// КЛИЕНТСКИЕ ПРОЦЕДУРЫ //

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	НоваяСтрока     = Объект.План.Добавить();
	НоваяСтрока.УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
	СоздатьОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	УИД = СтрЗаменить(Команда.Имя,"Удалить_","");
	УдалитьЭлементыСтроки(УИД);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизита (Элемент)
	НастройкаФормКлиент.ПриИзмененииРеквизита(ЭтаФорма,Объект,"План",Элемент);
КонецПроцедуры	

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ //

&НаСервере
Процедура СоздатьОбновитьЭлементыФормы ()
	НастройкаФормСервер.СоздатьОбновитьЭлементыФормы(ЭтаФорма,Объект,"План");
КонецПроцедуры	

&НаСервере
Процедура УдалитьЭлементыСтроки (УИД)
	НастройкаФормСервер.УдалитьЭлементыСтроки(ЭтаФорма,Объект,"План",УИД);
КонецПроцедуры
